## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.rcm_adb_app will be created
  + resource "azuread_application" "rcm_adb_app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "vj-rcm-dev-adb-app"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_service_principal.rcm_adb_sp will be created
  + resource "azuread_service_principal" "rcm_adb_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal_password.rcm_adb_pass will be created
  + resource "azuread_service_principal_password" "rcm_adb_pass" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + rotate_when_changed  = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azurerm_key_vault.rcm_kv will be updated in-place
  ~ resource "azurerm_key_vault" "rcm_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = [
                    "Backup",
                    "Delete",
                    "DeleteSAS",
                    "Get",
                    "GetSAS",
                    "List",
                    "ListSAS",
                    "Purge",
                    "Recover",
                    "RegenerateKey",
                    "Restore",
                    "Set",
                    "SetSAS",
                    "Update",
                ]
                tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "UnwrapKey",
                  - "WrapKey",
                ]
              - object_id               = "56398b68-1397-4db1-b40e-13e56dc3e60f"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "3603a805-8ec8-461c-90f5-de2fa73a73a6"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "632f673e-3d53-45ac-89e1-02ed7afd3acf"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
        name                            = "vj-rcm-dev-kv"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_storage_container.rcm_container["bronze"] must be replaced
-/+ resource "azurerm_storage_container" "rcm_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://vjrcmdevstorage.blob.core.windows.net/bronze" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "bronze"
      ~ resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/bronze" -> (known after apply)
      + storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" # forces replacement
      - storage_account_name              = "vjrcmdevstorage" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.rcm_container["configs"] must be replaced
-/+ resource "azurerm_storage_container" "rcm_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://vjrcmdevstorage.blob.core.windows.net/configs" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "configs"
      ~ resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/configs" -> (known after apply)
      + storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" # forces replacement
      - storage_account_name              = "vjrcmdevstorage" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.rcm_container["gold"] must be replaced
-/+ resource "azurerm_storage_container" "rcm_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://vjrcmdevstorage.blob.core.windows.net/gold" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "gold"
      ~ resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/gold" -> (known after apply)
      + storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" # forces replacement
      - storage_account_name              = "vjrcmdevstorage" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.rcm_container["landing"] must be replaced
-/+ resource "azurerm_storage_container" "rcm_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://vjrcmdevstorage.blob.core.windows.net/landing" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "landing"
      ~ resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/landing" -> (known after apply)
      + storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" # forces replacement
      - storage_account_name              = "vjrcmdevstorage" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.rcm_container["silver"] must be replaced
-/+ resource "azurerm_storage_container" "rcm_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://vjrcmdevstorage.blob.core.windows.net/silver" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "silver"
      ~ resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/silver" -> (known after apply)
      + storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" # forces replacement
      - storage_account_name              = "vjrcmdevstorage" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.rcm_container["tfstate"] must be replaced
-/+ resource "azurerm_storage_container" "rcm_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://vjrcmdevstorage.blob.core.windows.net/tfstate" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "tfstate"
      ~ resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/tfstate" -> (known after apply)
      + storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" # forces replacement
      - storage_account_name              = "vjrcmdevstorage" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # databricks_service_principal.rcm_db_sp will be created
  + resource "databricks_service_principal" "rcm_db_sp" {
      + acl_principal_id           = (known after apply)
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + application_id             = (known after apply)
      + databricks_sql_access      = false
      + display_name               = "vj-rcm-dev-adb-app"
      + home                       = (known after apply)
      + id                         = (known after apply)
      + repos                      = (known after apply)
      + workspace_access           = false
    }

  # time_rotating.month will be created
  + resource "time_rotating" "month" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 45
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 11 to add, 1 to change, 6 to destroy.
```
</details>